Catalogs/омг_РазделыОбучения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>омг_РазделыОбучения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СсылкаНаВидео</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонтента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.омг_ТипыКонтента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищеДополнительнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКартинкиТипаКонтента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/омг_ТипыКонтента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>омг_ТипыКонтента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Видео</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/омг_РазделыОбучения/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Перем ИмяФайлаДокументаКандидат;

&НаКлиенте
Процедура ТипКонтентаПриИзменении(Элемент)
    ОбновитьВидимостьПолей();
КонецПроцедуры

Процедура ОбновитьВидимостьПолей()
	
	Если 
		Объект.ТипКонтента = Перечисления.омг_ТипыКонтента.Видео  Тогда
		Элементы.СсылкаНаВидео.Видимость = Истина; 
		
			Иначе
		Элементы.СсылкаНаВидео.Видимость = Ложь
	КонецЕсли;
	Если 
		Объект.ТипКонтента = Перечисления.омг_ТипыКонтента.Документ Тогда
		Элементы.Документ.Видимость = Истина;
		Элементы.КнопкаЗагрузить.Видимость = Истина;
		Элементы.ОткрытьФайл.Видимость = Истина;
			Иначе
		Элементы.Документ.Видимость = Ложь;
		Элементы.КнопкаЗагрузить.Видимость = Ложь;
		Элементы.ОткрытьФайл.Видимость = Ложь;
	КонецЕсли;
	Объект.НомерКартинкиТипаКонтента = ОбщегоНазначенияПереопределяемый.ПолучитьИндексЭлементаПеречисления(Объект.ТипКонтента)+1;
  КонецПроцедуры

//&НаСервере
//Процедура ПриОткрытии()
//	Элементы.СсылкаНаВидео.Видимость = Ложь;
//	Элементы.Документ.Видимость = Ложь;
//	Элементы.КнопкаЗагрузить.Видимость = Ложь;


//    ОбновитьВидимостьПолей();
//КонецПроцедуры

&НаКлиенте
Процедура КнопкаЗагрузить(Команда)
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	ДиалогОткрытияФайла.Фильтр = "PDF документы (*.pdf)|*.pdf";
	//ДиалогОткрытияФайла.Фильтр = "Все файлы "+"(*.*)|*.*";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл";
	
	Если ДиалогОткрытияФайла.Выбрать() Тогда	
		Для Каждого Файл из ДиалогОткрытияФайла.ВыбранныеФайлы Цикл	
		СсылкаНаФайл = РаботаСФайламиКлиент.ДобавитьНовыйФайл( , Файл,);
		    Объект.Документ = СсылкаНаФайл;
			//ОповеститьОбИзмененииСоставаФайлов(ТекВладелец);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Элементы.СсылкаНаВидео.Видимость = Ложь;
	Элементы.Документ.Видимость = Ложь;
	Элементы.КнопкаЗагрузить.Видимость = Ложь;
	Элементы.ОткрытьФайл.Видимость = Ложь;


    ОбновитьВидимостьПолей();

КонецПроцедуры

///Карсаков Проверка открытия файла 
&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	
	ОткрытиеФайла(Объект.Документ);
	
КонецПроцедуры

&НаКлиенте
Функция ОткрытиеФайла(СсылкаНаФайл)
	
	СтрокаКеш = ПолучитьКешированныйПутьКФайлу(СсылкаНаФайл);
	Если СтрокаКеш <> Неопределено Тогда 
		СтрокаКеш.ПутьКФайлу = ВыполнитьОткрытиеФайла(СсылкаНаФайл, СтрокаКеш.ПутьКФайлу);
	Иначе
		ПутьКФайлу = ВыполнитьОткрытиеФайла(СсылкаНаФайл);
		
		Если ЗначениеЗаполнено(ПутьКФайлу) Тогда 
			ДобавитьКешированныйПутьКФайлу(СсылкаНаФайл, ПутьКФайлу);
		Иначе
			Если Вопрос("Невозможно получить файл, возможно он был удален или перемещен. Удалить из списка?", 
				РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да 
			Тогда
				РаботаСФайламиКлиент.УдалитьФайл(СсылкаНаФайл);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции 
&НаКлиенте
Функция ДобавитьКешированныйПутьКФайлу(СсылкаНаФайл, ПутьКФайлу)
	
	СтрокаКеш = ПолучитьКешированныйПутьКФайлу(СсылкаНаФайл);
	Если СтрокаКеш = Неопределено Тогда 
		НоваяСтрока = КешПутейКФайлам.Добавить();
		НоваяСтрока.Файл = СсылкаНаФайл;
		НоваяСтрока.ПутьКФайлу = ПутьКФайлу;
		СтрокаКеш = НоваяСтрока;
	Иначе
		СтрокаКеш.ПутьКФайлу = ПутьКФайлу;
	КонецЕсли;
	
	Возврат СтрокаКеш;
	
КонецФункции

&НаКлиенте
Функция ПолучитьКешированныйПутьКФайлу(СсылкаНаФайл)
	
	НайдСтроки = КешПутейКФайлам.НайтиСтроки(Новый Структура("Файл", СсылкаНаФайл));
	Если НайдСтроки.Количество() > 0 Тогда 
		Возврат НайдСтроки[0];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции
&НаКлиенте
Функция ВыполнитьОткрытиеФайла(СсылкаНаФайл, КешированныйПуть=Неопределено)
	
	РасширениеФайла = НРег(ОбщегоНазначения.ПолучитьЗначениеРеквизита(СсылкаНаФайл, "Расширение"));
	Если РасширениеФайла = ".mxl" Тогда
		ПутьКФайлу = РаботаСФайламиКлиент.ОткрытьФайл(СсылкаНаФайл,,КешированныйПуть, Истина);
		Если Не ЗначениеЗаполнено(ПутьКФайлу) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Прикрепленный файл не найден");
			Возврат "";
		КонецЕсли;
		
		АдресХранилища = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПутьКФайлу), УникальныйИдентификатор);
		СтруктураПечати = ПолучитьСтруктуруПечатиТабДока(АдресХранилища);
		Если СтруктураПечати = Неопределено Тогда 
			ОбщегоНазначения.СообщитьПользователю("Не удалось открыть файл");
		Иначе
			ПечатьДокументовКлиент.ВывестиНапечататьДокумент(СтруктураПечати, Неопределено);
		КонецЕсли;
	Иначе
		ПутьКФайлу = РаботаСФайламиКлиент.ОткрытьФайл(СсылкаНаФайл,,КешированныйПуть);
	КонецЕсли;
	
	Возврат ПутьКФайлу;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруПечатиТабДока(АдресХранилища)
	
	ТабДок = ПолучитьТабДокНаСервере(АдресХранилища);
	
	Если ТабДок <> Неопределено Тогда
		Возврат УниверсальныеМеханизмыСервер.НапечататьДокумент(ТабДок);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции  

&НаСервереБезКонтекста
Функция ПолучитьТабДокНаСервере(АдресХранилища)
	
	ТабДок = Новый ТабличныйДокумент;
	ДанныеТабДока = ПолучитьИзВременногоХранилища(АдресХранилища);
	ВременныйФайл = ПолучитьИмяВременногоФайла(".mxl");
	ДанныеТабДока.Записать(ВременныйФайл);
	Попытка
		ТабДок.Прочитать(ВременныйФайл);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	Возврат ТабДок;
	
КонецФункции
